Repository: futuricon/WUCSA_Web
Catalog: src/WUCSA.Web/Resources/Pages/Index.*.resx
Languages: ru, uz

source: All Events
ru: Все События
uz: Barcha tadbirlar

source: All Members
ru: Все Сотрудники
uz: Barcha Xodimlar

source: All News
ru: Все Новости
uz: Barcha Yangiliklar

source: AuthorFullName
ru: Усманов Фахриддин
uz: Usmonov Faxriddin

source: Gallery
ru: Галерея
uz: Galereya

source: History of WUCSA
ru: История WUCSA
uz: WUCSA Tarixi

source: Images &amp; Videos
ru: Изображения и Видео
uz: Rasmlar va videolar

source: IndexCard
ru: Официальный Веб-сайт Всемирной ассоциации боевых систем Усманова
uz: Jahon Usmanov Combat Sistems Assotsiatsiyasi rasmiy Veb-sayti

source: IndexDescription
ru: Всемирная Ассоциация Боевых Систем Усманова, Боевые системы Усманова имеют 11 дисциплин, включая демонстрацию, легкий контакт, полный контакт A, полный контакт B, нокдаун A, нокдаун B, боевую борьбу, бой на ножах, короткий меч Чамбара, длинный меч Чамбара и Муайборан .
uz: Jahon Usmanov Combat Sistems Assotsiatsiyasi, Usmonov Combat Sistems 11 yo'nalishni o' zichiga oladi bular engil kontakt, ful kontakt A, ful kontakt B, nokdaun A, nokdaun B, Combat kurash, pichoq jangi, chambara kalta qilich, chambara uzun qilich va Muayboran.

source: IndexKeyWords
ru: wucsa, World, Usmanov`s, Combat, Systems, Association, Фахриддин, Усманов, Демонстрация, легкий контакт, полный контакт A, полный контакт B, нокдаун A, нокдаун B, боевая борьба, Ножевой бой, короткий меч Чамбара, длинный меч Чамбара, Муайборан, международный, Айкидо, Федерация
uz: WUCSA, World , Usmonov's , Combat, Systems,Association, Usmanov, Faxriddin, Ko'rgazmali chiqish , yengil kontakt, ful kontakt A, ful kontakt B, nokdaun A, nokdaun B, Combat kurash, Pichoq jangi, Chambara qisqa qilich, Chambara uzun qilich, Muayboran, xalqaro, Aykido, Federatsiya

source: IndexTitle
ru: Всемирная Ассоциация Боевых Систем Усманова
uz: Jahon Usmanov Combat Sistems Assotsiatsiyasi

source: Latest Events
ru: Последние События
uz: So'nggi Voqealar

source: Latest News &amp; Blog
ru: Последние Новости и Блог
uz: So'nggi Yangiliklar va Blog

source: LegacyOf
ru: Негосударственная Некоммерческая Организация
uz: Nodavlat Notijorat Tashkiloti

source: More
ru: Больше
uz: Ko'proq

source: More Images &amp; Videos in our Gallery
ru: Больше Изображений и Видео в нашей Галерее
uz: Galereyamizdagi boshqa Rasm va Videolar

source: Our Staff
ru: Наш Персонал
uz: Bizning Xodimlarimiz

source: Read More
ru: Читать далее
uz: Davomini o'qish

source: See More
ru: Увидеть Больше
uz: Ko'proq ko'rish

source: There are no any Events yet
ru: Событий пока нет
uz: Hech qanday Tadbir yo'q

source: There are no any Posts yet
ru: Публикаций пока нет
uz: Hech qanday Xabar yo'q

source: There are no any Staff yet
ru: Сотрудников пока нет
uz: Hozircha Xodimlar yo'q
